{"name":"CloneDocument","content":"({\n    start: function(documentId, personalityId , newTitle, proofread) {\n        let document = webSkel.currentUser.space.getDocument(documentId);\n        let simplifiedDocumentJson= JSON.stringify(document.simplifyDocument());\n        if (proofread) {\n            if (personalityId === \"copy\") {\n                this.prompt = `Please review this document in its JSON format: ${simplifiedDocumentJson}. Your task is to replicate the document as it is, maintaining its original context and format. Additionally, conduct a thorough proofreading to correct any grammatical errors, ambiguities, or inconsistencies, thereby refining the document to ensure clarity and accuracy.`;\n            } else {\n                let personality = webSkel.currentUser.space.getPersonality(personalityId);\n                this.prompt = `Please carefully examine and comprehend this document, presented in JSON format: ${simplifiedDocumentJson}. Your challenge is to replicate this document from the perspective of an individual characterized by certain distinct personality traits: ${personality.description}. In doing so, preserve the original context, yet adapt the language to reflect the unique linguistic style of this personality. Additionally, attentively identify and rectify any grammatical errors, ambiguities, or inconsistencies in the text, enhancing it with improved, clearer expressions.`;\n            }\n        } else {\n            if (personalityId === \"copy\") {\n                this.prompt = `Your objective is to duplicate this document exactly as it is, presented in JSON format: ${simplifiedDocumentJson}. Please ensure that the copy you create is an exact replica of the original, maintaining the same context and structure, without making any modifications or corrections.`;\n            } else {\n                 let personality = webSkel.currentUser.space.getPersonality(personalityId);\n                this.prompt = `Please analyze and replicate this document, presented in JSON format: ${simplifiedDocumentJson}, from the perspective of an individual with specific personality traits: ${personality.description}. While preserving the original context, adapt the language to mirror the linguistic style associated with these personality traits. Note that no proofreading for grammatical accuracy or consistency is required in this task.`;\n            }\n        }\n\n        this.setDefaultValues();\n        this.setIntelligenceLevel(3);\n        this.execute(newTitle);\n    },\n    execute: async function(newTitle) {\n        let text =  await this.request(this.prompt);\n        try{\n            let docObj = JSON.parse(text);\n            docObj.title = newTitle;\n            await documentFactory.addDocument(webSkel.currentUser.space.id, new DocumentModel(docObj));\n            this.return(JSON.stringify(docObj));\n        }catch(e){\n            this.fail(e);\n        }\n    }\n})\n","id":"2xMkntPX8k3k","description":"The second iteration of the clone document script","tags":["documents","presenters","agents"]}